; domain
(define (domain emergencia)
  (:requirements :strips :typing)

  (:types
    location
    person
    crate
    content
    drone
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (has-content ?c - crate ?con - content)
    (has ?p - person ?con - content)

    (free-arm1 ?d - drone)
    (free-arm2 ?d - drone)

    (carrying-arm1 ?d - drone ?c - crate)
    (carrying-arm2 ?d - drone ?c - crate)

    (available ?c - crate)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition
      (at-drone ?d ?from)
    :effect
      (and
        (not (at-drone ?d ?from))
        (at-drone ?d ?to)
      )
  )

  (:action pickup-arm1
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm1 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm1 ?d))
        (not (available ?c))
        (carrying-arm1 ?d ?c)
      )
  )

  (:action pickup-arm2
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm2 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm2 ?d))
        (not (available ?c))
        (carrying-arm2 ?d ?c)
      )
  )

  (:action deliver-arm1
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm1 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm1 ?d ?c))
        (free-arm1 ?d)
        (has ?p ?con)
      )
  )

  (:action deliver-arm2
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm2 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm2 ?d ?c))
        (free-arm2 ?d)
        (has ?p ?con)
      )
  )
)

; problem
(define (problem drone_problem_d1_r0_l32_p32_c32_g32_ct2)
(:domain emergencia)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
)
(:init
	(at-drone drone1 depot)
	(free-arm1 drone1)
	(free-arm2 drone1)
	(at-crate crate1 depot)
	(available crate1)
	(at-crate crate2 depot)
	(available crate2)
	(at-crate crate3 depot)
	(available crate3)
	(at-crate crate4 depot)
	(available crate4)
	(at-crate crate5 depot)
	(available crate5)
	(at-crate crate6 depot)
	(available crate6)
	(at-crate crate7 depot)
	(available crate7)
	(at-crate crate8 depot)
	(available crate8)
	(at-crate crate9 depot)
	(available crate9)
	(at-crate crate10 depot)
	(available crate10)
	(at-crate crate11 depot)
	(available crate11)
	(at-crate crate12 depot)
	(available crate12)
	(at-crate crate13 depot)
	(available crate13)
	(at-crate crate14 depot)
	(available crate14)
	(at-crate crate15 depot)
	(available crate15)
	(at-crate crate16 depot)
	(available crate16)
	(at-crate crate17 depot)
	(available crate17)
	(at-crate crate18 depot)
	(available crate18)
	(at-crate crate19 depot)
	(available crate19)
	(at-crate crate20 depot)
	(available crate20)
	(at-crate crate21 depot)
	(available crate21)
	(at-crate crate22 depot)
	(available crate22)
	(at-crate crate23 depot)
	(available crate23)
	(at-crate crate24 depot)
	(available crate24)
	(at-crate crate25 depot)
	(available crate25)
	(at-crate crate26 depot)
	(available crate26)
	(at-crate crate27 depot)
	(available crate27)
	(at-crate crate28 depot)
	(available crate28)
	(at-crate crate29 depot)
	(available crate29)
	(at-crate crate30 depot)
	(available crate30)
	(at-crate crate31 depot)
	(available crate31)
	(at-crate crate32 depot)
	(available crate32)
	(has-content crate1 food)
	(has-content crate2 food)
	(has-content crate3 food)
	(has-content crate4 food)
	(has-content crate5 food)
	(has-content crate6 food)
	(has-content crate7 food)
	(has-content crate8 food)
	(has-content crate9 food)
	(has-content crate10 food)
	(has-content crate11 food)
	(has-content crate12 food)
	(has-content crate13 food)
	(has-content crate14 food)
	(has-content crate15 food)
	(has-content crate16 food)
	(has-content crate17 food)
	(has-content crate18 food)
	(has-content crate19 food)
	(has-content crate20 food)
	(has-content crate21 food)
	(has-content crate22 food)
	(has-content crate23 food)
	(has-content crate24 food)
	(has-content crate25 food)
	(has-content crate26 food)
	(has-content crate27 food)
	(has-content crate28 food)
	(has-content crate29 medicine)
	(has-content crate30 medicine)
	(has-content crate31 medicine)
	(has-content crate32 medicine)
	(at-person person1 loc26)
	(at-person person2 loc27)
	(at-person person3 loc21)
	(at-person person4 loc1)
	(at-person person5 loc14)
	(at-person person6 loc1)
	(at-person person7 loc1)
	(at-person person8 loc7)
	(at-person person9 loc13)
	(at-person person10 loc8)
	(at-person person11 loc13)
	(at-person person12 loc20)
	(at-person person13 loc18)
	(at-person person14 loc12)
	(at-person person15 loc7)
	(at-person person16 loc31)
	(at-person person17 loc26)
	(at-person person18 loc6)
	(at-person person19 loc2)
	(at-person person20 loc18)
	(at-person person21 loc29)
	(at-person person22 loc8)
	(at-person person23 loc17)
	(at-person person24 loc9)
	(at-person person25 loc23)
	(at-person person26 loc8)
	(at-person person27 loc10)
	(at-person person28 loc18)
	(at-person person29 loc2)
	(at-person person30 loc3)
	(at-person person31 loc3)
	(at-person person32 loc14)
)
(:goal (and
	(at-drone drone1 depot)
	(has person1 food)
	(has person2 food)
	(has person3 food)
	(has person4 food)
	(has person5 food)
	(has person6 food)
	(has person7 food)
	(has person7 medicine)
	(has person8 food)
	(has person9 food)
	(has person10 food)
	(has person10 medicine)
	(has person11 food)
	(has person12 food)
	(has person13 food)
	(has person14 food)
	(has person15 food)
	(has person16 food)
	(has person17 food)
	(has person18 food)
	(has person19 food)
	(has person19 medicine)
	(has person21 food)
	(has person21 medicine)
	(has person22 food)
	(has person23 food)
	(has person26 food)
	(has person27 food)
	(has person28 food)
	(has person29 food)
	(has person30 food)
	(has person31 food)
	))
)

; plan
1. (pickup-arm2 drone1 crate32 depot)
   deleted: (at-crate crate32 depot) (free-arm2 drone1) (available crate32)
   added: (carrying-arm2 drone1 crate32)
   goals met: 1 of 33
2. (pickup-arm1 drone1 crate28 depot)
   deleted: (at-crate crate28 depot) (free-arm1 drone1) (available crate28)
   added: (carrying-arm1 drone1 crate28)
   goals met: 1 of 33
3. (fly drone1 depot loc31)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc31)
   goals met: 0 of 33
4. (deliver-arm1 drone1 crate28 person16 food loc31)
   deleted: (carrying-arm1 drone1 crate28)
   added: (free-arm1 drone1) (has person16 food)
   goals met: 1 of 33
5. (fly drone1 loc31 depot)
   deleted: (at-drone drone1 loc31)
   added: (at-drone drone1 depot)
   goals met: 2 of 33
6. (pickup-arm1 drone1 crate27 depot)
   deleted: (at-crate crate27 depot) (free-arm1 drone1) (available crate27)
   added: (carrying-arm1 drone1 crate27)
   goals met: 2 of 33
7. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 1 of 33
8. (deliver-arm1 drone1 crate27 person2 food loc27)
   deleted: (carrying-arm1 drone1 crate27)
   added: (free-arm1 drone1) (has person2 food)
   goals met: 2 of 33
9. (fly drone1 loc27 depot)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 depot)
   goals met: 3 of 33
10. (pickup-arm1 drone1 crate26 depot)
   deleted: (at-crate crate26 depot) (free-arm1 drone1) (available crate26)
   added: (carrying-arm1 drone1 crate26)
   goals met: 3 of 33
11. (fly drone1 depot loc21)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc21)
   goals met: 2 of 33
12. (deliver-arm1 drone1 crate26 person3 food loc21)
   deleted: (carrying-arm1 drone1 crate26)
   added: (free-arm1 drone1) (has person3 food)
   goals met: 3 of 33
13. (fly drone1 loc21 depot)
   deleted: (at-drone drone1 loc21)
   added: (at-drone drone1 depot)
   goals met: 4 of 33
14. (pickup-arm1 drone1 crate25 depot)
   deleted: (at-crate crate25 depot) (free-arm1 drone1) (available crate25)
   added: (carrying-arm1 drone1 crate25)
   goals met: 4 of 33
15. (fly drone1 depot loc20)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc20)
   goals met: 3 of 33
16. (deliver-arm1 drone1 crate25 person12 food loc20)
   deleted: (carrying-arm1 drone1 crate25)
   added: (free-arm1 drone1) (has person12 food)
   goals met: 4 of 33
17. (fly drone1 loc20 depot)
   deleted: (at-drone drone1 loc20)
   added: (at-drone drone1 depot)
   goals met: 5 of 33
18. (pickup-arm1 drone1 crate24 depot)
   deleted: (at-crate crate24 depot) (free-arm1 drone1) (available crate24)
   added: (carrying-arm1 drone1 crate24)
   goals met: 5 of 33
19. (fly drone1 depot loc17)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc17)
   goals met: 4 of 33
20. (deliver-arm1 drone1 crate24 person23 food loc17)
   deleted: (carrying-arm1 drone1 crate24)
   added: (free-arm1 drone1) (has person23 food)
   goals met: 5 of 33
21. (fly drone1 loc17 depot)
   deleted: (at-drone drone1 loc17)
   added: (at-drone drone1 depot)
   goals met: 6 of 33
22. (pickup-arm1 drone1 crate23 depot)
   deleted: (at-crate crate23 depot) (free-arm1 drone1) (available crate23)
   added: (carrying-arm1 drone1 crate23)
   goals met: 6 of 33
23. (fly drone1 depot loc14)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc14)
   goals met: 5 of 33
24. (deliver-arm1 drone1 crate23 person5 food loc14)
   deleted: (carrying-arm1 drone1 crate23)
   added: (free-arm1 drone1) (has person5 food)
   goals met: 6 of 33
25. (fly drone1 loc14 depot)
   deleted: (at-drone drone1 loc14)
   added: (at-drone drone1 depot)
   goals met: 7 of 33
26. (pickup-arm1 drone1 crate22 depot)
   deleted: (at-crate crate22 depot) (free-arm1 drone1) (available crate22)
   added: (carrying-arm1 drone1 crate22)
   goals met: 7 of 33
27. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 6 of 33
28. (deliver-arm1 drone1 crate22 person14 food loc12)
   deleted: (carrying-arm1 drone1 crate22)
   added: (free-arm1 drone1) (has person14 food)
   goals met: 7 of 33
29. (fly drone1 loc12 depot)
   deleted: (at-drone drone1 loc12)
   added: (at-drone drone1 depot)
   goals met: 8 of 33
30. (pickup-arm1 drone1 crate21 depot)
   deleted: (at-crate crate21 depot) (free-arm1 drone1) (available crate21)
   added: (carrying-arm1 drone1 crate21)
   goals met: 8 of 33
31. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 7 of 33
32. (deliver-arm1 drone1 crate21 person27 food loc10)
   deleted: (carrying-arm1 drone1 crate21)
   added: (free-arm1 drone1) (has person27 food)
   goals met: 8 of 33
33. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 9 of 33
34. (pickup-arm1 drone1 crate20 depot)
   deleted: (at-crate crate20 depot) (free-arm1 drone1) (available crate20)
   added: (carrying-arm1 drone1 crate20)
   goals met: 9 of 33
35. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 8 of 33
36. (deliver-arm1 drone1 crate20 person18 food loc6)
   deleted: (carrying-arm1 drone1 crate20)
   added: (free-arm1 drone1) (has person18 food)
   goals met: 9 of 33
37. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 10 of 33
38. (pickup-arm1 drone1 crate19 depot)
   deleted: (at-crate crate19 depot) (free-arm1 drone1) (available crate19)
   added: (carrying-arm1 drone1 crate19)
   goals met: 10 of 33
39. (fly drone1 depot loc29)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc29)
   goals met: 9 of 33
40. (deliver-arm2 drone1 crate32 person21 medicine loc29)
   deleted: (carrying-arm2 drone1 crate32)
   added: (free-arm2 drone1) (has person21 medicine)
   goals met: 10 of 33
41. (deliver-arm1 drone1 crate19 person21 food loc29)
   deleted: (carrying-arm1 drone1 crate19)
   added: (free-arm1 drone1) (has person21 food)
   goals met: 11 of 33
42. (fly drone1 loc29 depot)
   deleted: (at-drone drone1 loc29)
   added: (at-drone drone1 depot)
   goals met: 12 of 33
43. (pickup-arm2 drone1 crate31 depot)
   deleted: (at-crate crate31 depot) (free-arm2 drone1) (available crate31)
   added: (carrying-arm2 drone1 crate31)
   goals met: 12 of 33
44. (pickup-arm1 drone1 crate18 depot)
   deleted: (at-crate crate18 depot) (free-arm1 drone1) (available crate18)
   added: (carrying-arm1 drone1 crate18)
   goals met: 12 of 33
45. (fly drone1 depot loc26)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc26)
   goals met: 11 of 33
46. (deliver-arm1 drone1 crate18 person1 food loc26)
   deleted: (carrying-arm1 drone1 crate18)
   added: (free-arm1 drone1) (has person1 food)
   goals met: 12 of 33
47. (fly drone1 loc26 depot)
   deleted: (at-drone drone1 loc26)
   added: (at-drone drone1 depot)
   goals met: 13 of 33
48. (pickup-arm1 drone1 crate17 depot)
   deleted: (at-crate crate17 depot) (free-arm1 drone1) (available crate17)
   added: (carrying-arm1 drone1 crate17)
   goals met: 13 of 33
49. (fly drone1 depot loc26)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc26)
   goals met: 12 of 33
50. (deliver-arm1 drone1 crate17 person17 food loc26)
   deleted: (carrying-arm1 drone1 crate17)
   added: (free-arm1 drone1) (has person17 food)
   goals met: 13 of 33
51. (fly drone1 loc26 depot)
   deleted: (at-drone drone1 loc26)
   added: (at-drone drone1 depot)
   goals met: 14 of 33
52. (pickup-arm1 drone1 crate16 depot)
   deleted: (at-crate crate16 depot) (free-arm1 drone1) (available crate16)
   added: (carrying-arm1 drone1 crate16)
   goals met: 14 of 33
53. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 13 of 33
54. (deliver-arm1 drone1 crate16 person13 food loc18)
   deleted: (carrying-arm1 drone1 crate16)
   added: (free-arm1 drone1) (has person13 food)
   goals met: 14 of 33
55. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 15 of 33
56. (pickup-arm1 drone1 crate15 depot)
   deleted: (at-crate crate15 depot) (free-arm1 drone1) (available crate15)
   added: (carrying-arm1 drone1 crate15)
   goals met: 15 of 33
57. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 14 of 33
58. (deliver-arm1 drone1 crate15 person28 food loc18)
   deleted: (carrying-arm1 drone1 crate15)
   added: (free-arm1 drone1) (has person28 food)
   goals met: 15 of 33
59. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 16 of 33
60. (pickup-arm1 drone1 crate14 depot)
   deleted: (at-crate crate14 depot) (free-arm1 drone1) (available crate14)
   added: (carrying-arm1 drone1 crate14)
   goals met: 16 of 33
61. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 15 of 33
62. (deliver-arm1 drone1 crate14 person9 food loc13)
   deleted: (carrying-arm1 drone1 crate14)
   added: (free-arm1 drone1) (has person9 food)
   goals met: 16 of 33
63. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 17 of 33
64. (pickup-arm1 drone1 crate13 depot)
   deleted: (at-crate crate13 depot) (free-arm1 drone1) (available crate13)
   added: (carrying-arm1 drone1 crate13)
   goals met: 17 of 33
65. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 16 of 33
66. (deliver-arm1 drone1 crate13 person11 food loc13)
   deleted: (carrying-arm1 drone1 crate13)
   added: (free-arm1 drone1) (has person11 food)
   goals met: 17 of 33
67. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 18 of 33
68. (pickup-arm1 drone1 crate12 depot)
   deleted: (at-crate crate12 depot) (free-arm1 drone1) (available crate12)
   added: (carrying-arm1 drone1 crate12)
   goals met: 18 of 33
69. (fly drone1 depot loc8)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc8)
   goals met: 17 of 33
70. (deliver-arm2 drone1 crate31 person10 medicine loc8)
   deleted: (carrying-arm2 drone1 crate31)
   added: (free-arm2 drone1) (has person10 medicine)
   goals met: 18 of 33
71. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 19 of 33
72. (pickup-arm2 drone1 crate30 depot)
   deleted: (at-crate crate30 depot) (free-arm2 drone1) (available crate30)
   added: (carrying-arm2 drone1 crate30)
   goals met: 19 of 33
73. (fly drone1 depot loc8)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc8)
   goals met: 18 of 33
74. (deliver-arm1 drone1 crate12 person10 food loc8)
   deleted: (carrying-arm1 drone1 crate12)
   added: (free-arm1 drone1) (has person10 food)
   goals met: 19 of 33
75. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 20 of 33
76. (pickup-arm1 drone1 crate11 depot)
   deleted: (at-crate crate11 depot) (free-arm1 drone1) (available crate11)
   added: (carrying-arm1 drone1 crate11)
   goals met: 20 of 33
77. (fly drone1 depot loc8)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc8)
   goals met: 19 of 33
78. (deliver-arm1 drone1 crate11 person22 food loc8)
   deleted: (carrying-arm1 drone1 crate11)
   added: (free-arm1 drone1) (has person22 food)
   goals met: 20 of 33
79. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 21 of 33
80. (pickup-arm1 drone1 crate10 depot)
   deleted: (at-crate crate10 depot) (free-arm1 drone1) (available crate10)
   added: (carrying-arm1 drone1 crate10)
   goals met: 21 of 33
81. (fly drone1 depot loc8)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc8)
   goals met: 20 of 33
82. (deliver-arm1 drone1 crate10 person26 food loc8)
   deleted: (carrying-arm1 drone1 crate10)
   added: (free-arm1 drone1) (has person26 food)
   goals met: 21 of 33
83. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 22 of 33
84. (pickup-arm1 drone1 crate9 depot)
   deleted: (at-crate crate9 depot) (free-arm1 drone1) (available crate9)
   added: (carrying-arm1 drone1 crate9)
   goals met: 22 of 33
85. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 21 of 33
86. (deliver-arm1 drone1 crate9 person8 food loc7)
   deleted: (carrying-arm1 drone1 crate9)
   added: (free-arm1 drone1) (has person8 food)
   goals met: 22 of 33
87. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 23 of 33
88. (pickup-arm1 drone1 crate8 depot)
   deleted: (at-crate crate8 depot) (free-arm1 drone1) (available crate8)
   added: (carrying-arm1 drone1 crate8)
   goals met: 23 of 33
89. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 22 of 33
90. (deliver-arm1 drone1 crate8 person15 food loc7)
   deleted: (carrying-arm1 drone1 crate8)
   added: (free-arm1 drone1) (has person15 food)
   goals met: 23 of 33
91. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 24 of 33
92. (pickup-arm1 drone1 crate7 depot)
   deleted: (at-crate crate7 depot) (free-arm1 drone1) (available crate7)
   added: (carrying-arm1 drone1 crate7)
   goals met: 24 of 33
93. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 23 of 33
94. (deliver-arm1 drone1 crate7 person30 food loc3)
   deleted: (carrying-arm1 drone1 crate7)
   added: (free-arm1 drone1) (has person30 food)
   goals met: 24 of 33
95. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 25 of 33
96. (pickup-arm1 drone1 crate6 depot)
   deleted: (at-crate crate6 depot) (free-arm1 drone1) (available crate6)
   added: (carrying-arm1 drone1 crate6)
   goals met: 25 of 33
97. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 24 of 33
98. (deliver-arm1 drone1 crate6 person31 food loc3)
   deleted: (carrying-arm1 drone1 crate6)
   added: (free-arm1 drone1) (has person31 food)
   goals met: 25 of 33
99. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 26 of 33
100. (pickup-arm1 drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (free-arm1 drone1) (available crate5)
   added: (carrying-arm1 drone1 crate5)
   goals met: 26 of 33
101. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 25 of 33
102. (deliver-arm2 drone1 crate30 person19 medicine loc2)
   deleted: (carrying-arm2 drone1 crate30)
   added: (free-arm2 drone1) (has person19 medicine)
   goals met: 26 of 33
103. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 27 of 33
104. (pickup-arm2 drone1 crate29 depot)
   deleted: (at-crate crate29 depot) (free-arm2 drone1) (available crate29)
   added: (carrying-arm2 drone1 crate29)
   goals met: 27 of 33
105. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 26 of 33
106. (deliver-arm2 drone1 crate29 person7 medicine loc1)
   deleted: (carrying-arm2 drone1 crate29)
   added: (free-arm2 drone1) (has person7 medicine)
   goals met: 27 of 33
107. (deliver-arm1 drone1 crate5 person4 food loc1)
   deleted: (carrying-arm1 drone1 crate5)
   added: (free-arm1 drone1) (has person4 food)
   goals met: 28 of 33
108. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 29 of 33
109. (pickup-arm2 drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (free-arm2 drone1) (available crate4)
   added: (carrying-arm2 drone1 crate4)
   goals met: 29 of 33
110. (pickup-arm1 drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (free-arm1 drone1) (available crate3)
   added: (carrying-arm1 drone1 crate3)
   goals met: 29 of 33
111. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 28 of 33
112. (deliver-arm2 drone1 crate4 person19 food loc2)
   deleted: (carrying-arm2 drone1 crate4)
   added: (free-arm2 drone1) (has person19 food)
   goals met: 29 of 33
113. (deliver-arm1 drone1 crate3 person29 food loc2)
   deleted: (carrying-arm1 drone1 crate3)
   added: (free-arm1 drone1) (has person29 food)
   goals met: 30 of 33
114. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 31 of 33
115. (pickup-arm2 drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (free-arm2 drone1) (available crate2)
   added: (carrying-arm2 drone1 crate2)
   goals met: 31 of 33
116. (pickup-arm1 drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (free-arm1 drone1) (available crate1)
   added: (carrying-arm1 drone1 crate1)
   goals met: 31 of 33
117. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 30 of 33
118. (deliver-arm2 drone1 crate2 person6 food loc1)
   deleted: (carrying-arm2 drone1 crate2)
   added: (free-arm2 drone1) (has person6 food)
   goals met: 31 of 33
119. (deliver-arm1 drone1 crate1 person7 food loc1)
   deleted: (carrying-arm1 drone1 crate1)
   added: (free-arm1 drone1) (has person7 food)
   goals met: 32 of 33
120. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 33 of 33
